In [1]:
%load_ext autoreload
%autoreload 2

In [2]:
import lib
import dotenv

In [3]:
dotenv.load_dotenv()

True

In [5]:
data = lib.get_data(lib.StatId.population.value)

In [6]:
values = lib.extract_values(data)
classes = lib.extract_classes(data)

In [8]:
values

        @tab   @cat01  @area       @time @unit          $
0      00001    A1101  00000  1975100000     人  111939643
1      00001    A1101  00000  1976100000     人  113094000
2      00001    A1101  00000  1977100000     人  114165000
3      00001    A1101  00000  1978100000     人  115190000
4      00001    A1101  00000  1979100000     人  116155000
...      ...      ...    ...         ...   ...        ...
99995  00001  A121302  15000  2001100000     人      79000
99996  00001  A121302  15000  2002100000     人      79000
99997  00001  A121302  15000  2003100000     人      79000
99998  00001  A121302  15000  2004100000     人      81000
99999  00001  A121302  15000  2005100000     人      78612

[100000 rows x 6 columns]

In [7]:
classes

[ClassData(id='tab', name='観測値', data=   @code @name @level
 0  00001   観測値      1),
 ClassData(id='cat01', name='Ａ\u3000人口・世帯', data=       @code                 @name @level @unit
 0      A1101             A1101_総人口      1     人
 1    A110101        A110101_総人口（男）      1     人
 2    A110102        A110102_総人口（女）      1     人
 3      A1102           A1102_日本人人口      1     人
 4    A110201      A110201_日本人人口（男）      1     人
 ..       ...                   ...    ...   ...
 564  A850205  A850205_父子世帯数（55歳以上）      1    世帯
 565    A9101            A9101_婚姻件数      1     組
 566    A9111    A9111_平均婚姻年齢（初婚の夫）      1     歳
 567    A9112    A9112_平均婚姻年齢（初婚の妻）      1     歳
 568    A9201            A9201_離婚件数      1     組

 [569 rows x 4 columns]),
 ClassData(id='area', name='地域', data=    @code @name @level
 0   00000    全国      1
 1   01000   北海道      2
 2   02000   青森県      2
 3   03000   岩手県      2
 4   04000   宮城県      2
 5   05000   秋田県      2
 6   06000   山形県      2
 7   07000   福島県      2
 8   08000   茨城県      2
 9   09000   栃木県      2
 10  10000   群馬県      2
 11  11000   埼玉県      2
 12  12000   千葉県      2
 13  13000   東京都      2
 14  14000  神奈川県      2
 15  15000   新潟県      2
 16  16000   富山県      2
 17  17000   石川県      2
 18  18000   福井県      2
 19  19000   山梨県      2
 20  20000   長野県      2
 21  21000   岐阜県      2
 22  22000   静岡県      2
 23  23000   愛知県      2
 24  24000   三重県      2
 25  25000   滋賀県      2
 26  26000   京都府      2
 27  27000   大阪府      2
 28  28000   兵庫県      2
 29  29000   奈良県      2
 30  30000  和歌山県      2
 31  31000   鳥取県      2
 32  32000   島根県      2
 33  33000   岡山県      2
 34  34000   広島県      2
 35  35000   山口県      2
 36  36000   徳島県      2
 37  37000   香川県      2
 38  38000   愛媛県      2
 39  39000   高知県      2
 40  40000   福岡県      2
 41  41000   佐賀県      2
 42  42000   長崎県      2
 43  43000   熊本県      2
 44  44000   大分県      2
 45  45000   宮崎県      2
 46  46000  鹿児島県      2
 47  47000   沖縄県      2),
 ClassData(id='time', name='調査年', data=         @code   @name @level
 0   1975100000  1975年度      1
 1   1976100000  1976年度      1
 2   1977100000  1977年度      1
 3   1978100000  1978年度      1
 4   1979100000  1979年度      1
 5   1980100000  1980年度      1
 6   1981100000  1981年度      1
 7   1982100000  1982年度      1
 8   1983100000  1983年度      1
 9   1984100000  1984年度      1
 10  1985100000  1985年度      1
 11  1986100000  1986年度      1
 12  1987100000  1987年度      1
 13  1988100000  1988年度      1
 14  1989100000  1989年度      1
 15  1990100000  1990年度      1
 16  1991100000  1991年度      1
 17  1992100000  1992年度      1
 18  1993100000  1993年度      1
 19  1994100000  1994年度      1
 20  1995100000  1995年度      1
 21  1996100000  1996年度      1
 22  1997100000  1997年度      1
 23  1998100000  1998年度      1
 24  1999100000  1999年度      1
 25  2000100000  2000年度      1
 26  2001100000  2001年度      1
 27  2002100000  2002年度      1
 28  2003100000  2003年度      1
 29  2004100000  2004年度      1
 30  2005100000  2005年度      1
 31  2006100000  2006年度      1
 32  2007100000  2007年度      1
 33  2008100000  2008年度      1
 34  2009100000  2009年度      1
 35  2010100000  2010年度      1
 36  2011100000  2011年度      1
 37  2012100000  2012年度      1
 38  2013100000  2013年度      1
 39  2014100000  2014年度      1
 40  2015100000  2015年度      1
 41  2016100000  2016年度      1
 42  2017100000  2017年度      1
 43  2018100000  2018年度      1
 44  2019100000  2019年度      1
 45  2020100000  2020年度      1
 46  2021100000  2021年度      1)]